# Membagi Pandas Data Frame menjadi dua secara acak

## Import modules

In [2]:
import pandas as pd #mengimport pandas sebagai pd
import numpy as np #mengimport pandas sebagai np

print(pd.__version__) #menampilkan pandas versi
print(np.__version__) #menampilkan numpy versi

1.1.3
1.19.2

## Persiapan Data Frame

In [3]:
r = 7 #jumlah baris
c = 6 #jumlah colom
cols = tuple('ABCDEF')

df = pd.DataFrame(np.random.randint(1, 20, size=(r, c)),columns=cols)
df

    A   B   C   D   E   F
0   4   6   5   1  19   7
1   8  16   3   3  11  18
2   8  14   4  11  13  14
3  11  12  14  14  19   1
4  18   3  11  13   7   7
5  14  17  18   7   1   1
6  18  14   9  18   7   9

## Membagi Data menjadi dua secara acak dan berdasarkan proporsi tertentu

In [4]:
df.shape

(7, 6)

In [5]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (5, 6)
df_2 shape: (2, 6)

In [6]:
df_1
df.rename(columns={'A':'1', 'B':'2', 'C':'3','D':'4','E':'5','F':'6'})

    1   2   3   4   5   6
0   4   6   5   1  19   7
1   8  16   3   3  11  18
2   8  14   4  11  13  14
3  11  12  14  14  19   1
4  18   3  11  13   7   7
5  14  17  18   7   1   1
6  18  14   9  18   7   9

In [8]:
df_2
df.rename(columns={'A':'a', 'B':'b', 'C':'c','D':'d','E':'e','F':'6'})

    a   b   c   d   e   6
0   4   6   5   1  19   7
1   8  16   3   3  11  18
2   8  14   4  11  13  14
3  11  12  14  14  19   1
4  18   3  11  13   7   7
5  14  17  18   7   1   1
6  18  14   9  18   7   9